1. PERKENALAN
NAMA: AUDI
BATCH: 002

2. JUDUL: HOSPITAL DATA MANAGEMENT SYSTEM

In [1]:
import numpy as np
import pandas as pd

In [16]:
#membaca file
df = pd.read_csv('heart.csv')

In [15]:
df.describe

<bound method NDFrame.describe of      age  sex  cp  trtbps  chol  fbs  restecg  thalachh  exng  oldpeak  slp  \
0     63    1   3     145   233    1        0       150     0      2.3    0
1     37    1   2     130   250    0        1       187     0      3.5    0
2     41    0   1     130   204    0        0       172     0      1.4    2
3     56    1   1     120   236    0        1       178     0      0.8    2
4     57    0   0     120   354    0        1       163     1      0.6    2
..   ...  ...  ..     ...   ...  ...      ...       ...   ...      ...  ...
298   57    0   0     140   241    0        1       123     1      0.2    1
299   45    1   3     110   264    0        1       132     0      1.2    1
300   68    1   0     144   193    1        1       141     0      3.4    1
301   57    1   0     130   131    0        1       115     1      1.2    1
302   57    0   1     130   236    0        0       174     0      0.0    1

     caa  thall  output
0      0      1       1
1      0      2       1
2      0      2       1
3      0      2       1
4      0      2       1
..   ...    ...     ...
298    0      3       0
299    0      3       0
300    2      3       0
301    1      3       0
302    1      2       0

[303 rows x 14 columns]>

In [17]:
df.head(5)

,age,sex,cp,trtbps,chol,fbs,restecg,thalachh,exng,oldpeak,slp,caa,thall,output
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

In [9]:
df.columns

Index(['age', 'sex', 'cp', 'trtbps', 'chol', 'fbs', 'restecg', 'thalachh',
       'exng', 'oldpeak', 'slp', 'caa', 'thall', 'output'],
      dtype='object')

In [24]:
#menampilkan lebih dari satu kolom (Series)
df[["age", "sex"]]

     age  sex
0     63    1
1     37    1
2     41    0
3     56    1
4     57    0
..   ...  ...
298   57    0
299   45    1
300   68    1
301   57    1
302   57    0

[303 rows x 2 columns]

In [26]:
#Umur diatas rata-rata data
age = df['age']
age.mean()

54.366336633663366

In [30]:
#Filtering sederhana
umur_diatas_54 = df[df_54["age"] > 54]
umur_diatas_54

NameError: name 'df_54' is not defined

In [ ]:
#Answer
print ("HOSPITAL DATA MANAGEMENT SYSTEM")
print (" 1. Input Data")
print (" 2. Hapus Data")
print (" 3. Menampilkan Data")
 operasi = input("Pilih Menu: ")
if (angka=="1"):
    print("Input nama pasien:")
    Nama = input("Nama : ")
    Kelamin = input("sex : ")
    Usia = input("age :")
    Penyakit = input("penyakit : ")
elif:
    (angka=="2"):
    print("Input nomor data yang ingin dihapus: ")
elif:
    (angka=="3"):
    print("Data Terinput")
else:
    print("Pilih Menu: ")
    else:
         print("Keluar dari program")
         break